Tekla Open API Reference for Tekla Structures 2025
WpfCreateApplyCancel Class
 Interaction logic for WPFCreateAppyCancel.xaml. Control is meant to be used with non-dependent plug-ins
 WpfCreateApplyCancel
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Tekla.Structures.Dialog.UIControls.WpfCreateApplyCancel
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfCreateApplyCancel : UserControl,
	IComponentConnector
Public Class WpfCreateApplyCancel
	Inherits UserControl
	Implements IComponentConnector
The WpfCreateApplyCancel type exposes the following members.
Constructors
Name | Description
WpfCreateApplyCancel
 Constructor
Top
Methods
Name | Description
InitializeComponent
 InitializeComponent
Top
Events
Name | Description
ApplyClicked
 The ApplyClicked event is raised when the Apply button is clicked.
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
CreateClicked
 The ApplyClicked event is raised when the Apply button is clicked.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace